hands-on-lab/jbds-backup/demo-camel-ws/src/main/resources/data/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <ns:getCustomerByName xmlns:ns="http://example.fuse.redhat.com/">RedHat</ns:getCustomerByName>
    </soap:Body>
</soap:Envelope>